# MiddleBendLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionSigmaProfileWithFold..::..MiddleBendLength Property
StructuralSectionSigmaProfileWithFold Class See Also
---
Middle Bend segment length.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double MiddleBendLength { get; set; }
```

Visual Basic
---
```text
Public Property MiddleBendLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MiddleBendLength {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionSigmaProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace